mdhardenburgh/Blinky/Packages/.cache/NXP.MKE14Z7_DFP.12.0.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKE14Z7_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKE14Z7</description>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="12.0.0" date="2019-06-10">NXP CMSIS packs based on MCUXpresso SDK 2.6.0</release>
    <release version="11.0.1" date="2019-04-26">Removed invalid entries from Software Content Register</release>
    <release version="11.0.0" date="2018-12-19">NXP CMSIS packs based on MCUXpresso SDK 2.5.0</release>
    <release version="10.0.3" date="2018-07-16">A problem with missing components from some example the projects were dependent on was fixed (KEX-4241); Incorrect path to linked libraries were fixed: a pack version was a static part of the path and hadn’t worked for pack versions other than v10.0.0 (KEX-4373); A problem with incorrectly defined XIP_BOOT_HEADER_ENABLE, XIP_BOOT_HEADER_DCD_ENABLE and XIP_EXTERNAL_FLASH preprocessor symbols was fixed (KEX-4553); Missing flash algorithms for MK27, MK28, LPC802 and LPC804 device family packs were added (KEX-4659).</release>
    <release version="10.0.2" date="2018-05-25">NXP CMSIS packs based on MCUXpresso SDK 2.4.0</release>
    <release version="10.0.1" date="2018-04-04">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0" date="2018-01-19">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0" date="2017-11-17">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Start up</description>
    <description Cclass="CMSIS Driver">NXP MCUXpresso SDK Peripheral CMSIS Drivers</description>
  </taxonomy>
  <devices>
    <family Dfamily="MKE14Z7" Dvendor="NXP:11">
      <description>KE1xZ MCUs are based on the ARM Cortex-M0+ core, running up to 72 MHz. These MCUs support up to 256 KB flash, 32 KB RAM, and a complete set of analog/digital features. The robust TSI module provides a high level of stability and accuracy to any HMI system. The 1-Msps ADC and FlexTimer modules provides a perfect solution for BLDC motor-control systems.</description>
      <device Dname="MKE14Z256xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="720000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE14Z256xxx7_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x8000" access="rx" default="1"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x0800" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x040000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fffe000" size="0x8000" access="rw" default="1"/>
        <algorithm name="arm/MKE1x_D32_2KB_SEC.FLM" start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00040000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKE14Z7.xml"/>
        <variant Dvariant="MKE14Z256VLL7">
          <compile header="fsl_device_registers.h" define="CPU_MKE14Z256VLL7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE14Z256VLL7/MKE14Z256xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE14Z256VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKE14Z256VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE14Z256VLH7/MKE14Z256xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MKE14Z128xxx7">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="720000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MKE14Z128xxx7_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" start="0x10000000" size="0x8000" access="rx" default="1"/>
        <memory name="FLEX_RAM" start="0x14000000" size="0x0800" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x020000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1ffff000" size="0x4000" access="rw" default="1"/>
        <algorithm name="arm/MKE1x_D32_2KB_SEC.FLM" start="0x10000000" size="0x00008000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <algorithm name="arm/MKE1x_P256_2KB_SEC.FLM" start="0x00000000" size="0x00020000" RAMstart="0x20000000" RAMsize="0x00001000" default="1"/>
        <debug svd="MKE14Z7.xml"/>
        <variant Dvariant="MKE14Z128VLL7">
          <compile header="fsl_device_registers.h" define="CPU_MKE14Z128VLL7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE14Z128VLL7/MKE14Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MKE14Z128VLH7">
          <compile header="fsl_device_registers.h" define="CPU_MKE14Z128VLH7"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MKE14Z128VLH7/MKE14Z128xxx7_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <accept Dname="MKE14Z128???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE14Z256???7*" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
    </condition>
    <condition id="device.MKE14Z7_AND_component.lpuart_adapter_AND_component.serial_manager_uart_AND_device.MKE14Z7_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_AND_driver.lpuart_AND_driver.port_AND_driver.smc_AND_utility.debug_console">
      <accept Dname="MKE14Z128???7*" Dvendor="NXP:11"/>
      <accept Dname="MKE14Z256???7*" Dvendor="NXP:11"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="Startup" Csub="MKE14Z7_startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="serial_manager_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
    </condition>
